# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Brew apps
brew "mas"
brew "wget"
brew "xz"
brew "zsh-syntax-highlighting"
brew "telnet"
brew "readline"
brew "packer"
brew "maven"
brew "git"
brew "jq"
#brew "gnu-sed --with-default names"
brew "git-extras"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "openssl"
brew "zlib"
brew "sqlite"
brew "pyenv"

# App casks
cask "alfred"
cask "iterm2"
cask "google-chrome"
cask "macdown"
cask "spotify"
cask "viscosity"
cask "visual-studio-code"
cask "zoomus"
cask "cakebrew"
cask "keepassxc"

# Font casks
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-metropolis"

# Mac App Store
mas "Xcode", id: 497799835
mas "Keynote", id: 409183694
mas "Slack", id: 803453959
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "1Password 7", id: 1333542190
mas "Amphetamine", id: 937984704
mas "WhatsApp", id: 1147396723
